'''Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями 8, 3, 15, 6, 4, 2,
второй массив надо заполнить значениями 0, 3, 4, 5,
(индексация начинается с нуля), т.к. именно в этих позициях первого массива стоят четные числа.'''

import random

first_arr = [random.randint(0, 30) for i in range(8)]
index_arr = []

for i in first_arr:
    if i % 2 == 0:
        index_arr.append(first_arr.index(i))

print(f'Первый массив {first_arr}')
print(f'Массив с индексами четных элементов: {index_arr}')